src/Enums/ТипыИдентификаторовТовараККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыИдентификаторовТовараККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КодТовараНеРаспознан</Name>
					<Comment>Код товара, который не распознан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеEAN8</Name>
					<Comment>Код товара в формате EAN-8, UPC-E</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеEAN13</Name>
					<Comment>Код товара в формате EAN-13, UPC-A</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеITF14</Name>
					<Comment>Код товара в формате ITF-14</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеDataMatrixGS1</Name>
					<Comment>Код товара в формате GS1 Data Matrix или Data Matrix маркировки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзделияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеЕГАИС2</Name>
					<Comment>Код товара в кодировке ЕГАИС 2.0 в формате PDF417</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеЕГАИС3</Name>
					<Comment>Код товара в кодировке ЕГАИС 3.0 в формате Data Matrix</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Эмитирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведенВОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведенВОборотПриВозврате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспортирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утилизирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаРозничнаяПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаЭкспортированВСтраныЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаЭкспортированЗаПределыСтранЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаВозвращенФизическомуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаПриУтратеИлиПовреждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаПриУничтожении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаКонфискация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаЛиквидацияПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаПоДоговоруРассрочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаПриПеремаркировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборотаВРезультатеСписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разагрегирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПовторнойМаркировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДругомуСобственнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведенВОборотОжидаетПеремаркировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/МаркировкаТоваровКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Получение кода маркировки без криптохвоста
//
// Параметры:
//  ШтрихКод			 - Строка	 - Штрихкод для преобразования
//  Сообщение			 - Строка - Признак того, чот штрихкод не явяется кодом маркировки
//  ФормироватьСкобками	 - Булево - Выбор шаблона формирования кода маркировки
// 
// Возвращаемое значение:
//  Строка - Сформированный код маркировки без криптохвота или текущий ШК
//
Функция ПолучитьКодМаркировки(ШтрихКод, Сообщение = "", ФормироватьСкобками = Истина, СтруктураМаркировки = Неопределено, ВФорматеGS1 = Истина) Экспорт
	
	// Разберем маркировку
	СтруктураМаркировки = 
		МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ШтрихКод);
		
	Если СтруктураМаркировки.ТипИдентификатораТовара <>
			ПредопределенноеЗначение("Перечисление.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1") Тогда
			
		ВФорматеGS1 = Ложь;
		
		Сообщение = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Код <%1> не является кодом маркировки.'"),
				ШтрихКод
			);
		Возврат ШтрихКод;
		
	КонецЕсли;
	
	Если ПустаяСтрока(СтруктураМаркировки.GTIN) Тогда
		
		Результат = ШтрихКод;
		
	ИначеЕсли ФормироватьСкобками Тогда
		
		МассивКода = Новый Массив;
		МассивКода.Добавить("(01)");
		МассивКода.Добавить(СтруктураМаркировки.GTIN);
		МассивКода.Добавить("(21)");
		МассивКода.Добавить(СтруктураМаркировки.СерийныйНомер);
		
		Результат = СтрСоединить(МассивКода, "");
		
	Иначе
		
		МассивКода = Новый Массив;
		МассивКода.Добавить("01");
		МассивКода.Добавить(СтруктураМаркировки.GTIN);
		МассивКода.Добавить("21");
		МассивКода.Добавить(СтруктураМаркировки.СерийныйНомер);
		
		Результат = СтрСоединить(МассивКода, "");
		
	КонецЕсли;
	
	// Сформируем код маркировки без криптохвостов
	Возврат Результат;
	
КонецФункции // ПолучитьКодМаркировки()

// Соспоставляет переданное состояние кода маркировки с полученными данными из Честного знака
//
// Параметры:
//  СостояниеИБ - ПеречислениеСсылка.СостоянияКодовМаркировки - проверяемые состояния кода маркировки.
//  СостояниеСМТ - Строка - данные, полученные из Честного знака.
//  РазрешенныеСостояния - Массив из ПеречислениеСсылка.СостоянияКодовМаркировки - состояния, соответствующие
//                                                                              хозоперации.
//  Примечание - Строка - (необязательное) - причина несоответствия хозоперации.
//
// Возвращаемое значение:
//  Булево - Истина, если состояния соответствуют, в противном случае Ложь.
//
Функция СопоставитьСостоянияКодовМаркировкиСЧестнымЗнаком(
		СостояниеИБ,
		СостояниеСМТ,
		РазрешенныеСостояния,
		Примечание) Экспорт
	
	СостоянияВыпущен       = ДайСостоянияВыпущен();
	СостоянияПолучен       = ДайСостоянияПолучен();
	СостоянияВОбороте      = ДайСостоянияВОбороте();
	СостоянияСписан        = ДайСостоянияСписан();
	СостоянияВыбыл         = ДайСостоянияВыбыл();
	СостоянияРасформирован = ДайСостоянияРасформирован();
	
	Если СостояниеСМТ = "EMITTED" Тогда
		// выпущен
		ДляПоиска = СостоянияВыпущен;
	ИначеЕсли СостояниеСМТ = "APPLIED" Тогда
		// получен
		ДляПоиска = СостоянияПолучен;
	ИначеЕсли СостояниеСМТ = "INTRODUCED" Тогда
		// в обороте
		ДляПоиска = СостоянияВОбороте;
	ИначеЕсли СостояниеСМТ = "WRITTEN_OFF" Тогда
		// списан
		ДляПоиска = СостоянияСписан;
	ИначеЕсли СостояниеСМТ = "RETIRED" Тогда
		// выбыл
		ДляПоиска = СостоянияВыбыл;
	ИначеЕсли СостояниеСМТ = "DISAGGREGATION" Тогда
		// расформирован
		ДляПоиска = СостоянияРасформирован;
	КонецЕсли;
	
	Если ДляПоиска.Найти(СостояниеИБ) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Если РазрешенныеСостояния <> Неопределено И РазрешенныеСостояния.Найти(СостояниеИБ) = Неопределено Тогда
			Примечание = НСтр("ru = 'Состояние не соответствует хоз. операции.'");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Возвращает текстовое представление состояний кода маркировки из "Честного знака"
//
// Возвращаемое значение:
//  Соответствие - текстовое представление состояния кода маркировки.
//   * Ключ - Строка - состояние из "Честного знака",
//   * Значение - Строка - текстовое представление.
//
Функция ПредставлениеСостояния() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("EMITTED"       , НСтр("ru = 'Эмитирован. Выпущен'"));
	Результат.Вставить("APPLIED"       , НСтр("ru = 'Эмитирован. Получен'"));
	Результат.Вставить("INTRODUCED"    , НСтр("ru = 'В обороте'"));
	Результат.Вставить("WRITTEN_OFF"   , НСтр("ru = 'КИ списан'"));
	Результат.Вставить("RETIRED"       , НСтр("ru = 'Выбыл'"));
	Результат.Вставить("DISAGGREGATION", НСтр("ru = 'Расформирован'"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ДайСостоянияВыпущен()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Эмитирован"));
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияПолучен()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Эмитирован"));
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияВОбороте()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВведенВОборот"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВведенВОборотПриВозврате")
	);
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияСписан()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Списан"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.НеИспользован"));
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияВыбыл()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборота"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаРозничнаяПродажа"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаЭкспортированВСтраныЕАЭС"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаЭкспортированЗаПределыСтранЕАЭС"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаВозвращенФизическомуЛицу"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаПриУтратеИлиПовреждении"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаПриУничтожении"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаКонфискация"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаЛиквидацияПредприятия"));
	Результат.Добавить(ПредопределенноеЗначение(
		"Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия")
	);
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаПоДоговоруРассрочки"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаПриПеремаркировке"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаВРезультатеСписания"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ПередачаДругомуСобственнику"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Экспортирован"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Утилизирован"));
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияРасформирован()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Разагрегирован"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
